Public Attributes | List of all members
API_PropertyObjectParams Struct Reference
Add-On Integration
Defines parameters for the property handler function. More...
#include <APIdefs_Callback.h>
 Public Attributes
API_PropertyObjectCmdID  | cmd
The identifier of the command the handler was called for. Its value can be APIPropObj_None, APIPropObj_AssignProperty, or APIPropObj_DisableProperty.
GS::uchar_t  | propertyName [API_UniLongNameLen]
The Unicode name of the property library part.
char  | propertyUnID [128]
The property library part's unique ID.
Detailed Description
Defines parameters for the property handler function.
Remarks
See the example for APIPropertyObjectCommandProc.
Member Data Documentation
◆ cmd
 API_PropertyObjectParams::cmd
The identifier of the command the handler was called for. Its value can be APIPropObj_None, APIPropObj_AssignProperty, or APIPropObj_DisableProperty.
◆ propertyName
 API_PropertyObjectParams::propertyName
The Unicode name of the property library part.
◆ propertyUnID
 API_PropertyObjectParams::propertyUnID
The property library part's unique ID.